// All issues
const issues = [
    {
        title: 'العدد الأول',
        src: 'first',
        date:'2025-01-25T00:00:00',
        secondDate:"24 يناير 2024",
        issues: [
            
            {
                name: "د. إلياس الهاني",
                title: "أثر المعرفة العقدية في الإصلاح الاجتماعي والسياسي عند محمد بن عبد الكريم الخطابي: مسالك ونماذج",
                caracteres: [
                    "جامعة أهومي البريطانية",
                    "المملكة المغربية"
                ],
                summary: "تعتبر المعرفة العقدية إحدى التجليات الفكرية والسلوكية التي تميز عالم الإنسان الذي اصطبغ وجدانه بالمحددات المعرفية ذات المشرب العقدي كالقرآن والسنة وسيرة السلف والعقل والفطرة التي تومض فيه طاقة تجعله يتمكن من خوض غمار التحديات وبناء المجتمعات، وبالنظر إلى شخصية محمد بن عبد الكريم الخطابي باعتباره أحد المصلحين الذي تعددت عطاءاته وانبثقت منها رؤية للإصلاح شملت ميادين متعددة منها الجانب الاجتماعي والسياسي مرسيا بذلك جملة من القواعد والأسس التي انبت على المعرفة العقدية التي تعرضت للتعطيل، ولم تعد تؤدي الأدوار المنوطة بها بفعل ما اعترى الإنسان من الاستعمار الأجنبي والركود الحضاري والتواكل القدري، وعليه تتأسس رؤية الخطابي الإصلاحية عبر اتخاذه لمجموعة من المسالك التربوية للنفوذ إلى النفوس والعقول لاستنهاضها للقيام بما توجبه اللحظة التاريخية من جوانب همّت الجانب الاجتماعي و السياسي .\nومنه فإن هذا البحث يهدف إلى رصد وتتبع المسالك التي اقتفاها الخطابي للنهوض بالسلوك الاجتماعي والسياسي انطلاقا من المعارف العقدية المنغرسة في الوجدان، والتي استطاع من خلالها إبراز  الأثر الذي تعكسه المعرفة العقدية في عملية الإصلاح، ويتضح ذلك جليا عبر عدة نماذج عرفتها منطقة شمال المغرب، وهي نفس القواعد التي بثّها الخطابي في رسائله ومقالاته واستراتيجياته المتعددة، متوسلا في ذلك بمنهج الوصف والتحليل.\n",
                keywords: "المعرفة العقدية، محمد بن عبد الكريم الخطابي، الإصلاح الاجتماعي والسياسي."
            },
            {
                name: "د. إسماعيل بلفقي و د. ناجية شموط",
                title: "الحماية المدنية للمعطيات ذات الطابع الشخصي في القانون المغربي",
                caracteres: [
                    "كلية العلوم القانونية والاقتصادية والاجتماعية",
                    "جامعة عبد المالك السعدي",
                    "المملكة المغربية"
                ],
                summary: "حرص المشرع المغربي على كفالة الحماية المناسبة للمعطيات ذات الطابع الشخصي من خلال إقراره مجموعة من التدابير والإجراءات الوقائية، كما منح المتضرر المعتدى على معطياته الشخصية بمقتضى المادة 52 من القانون 09.08 المتعلق بحمایة الأشخاص الذاتیین تجاه معالجة المعطیات ذات الطابع الشخصي، اللجوء إلى القضاء للمطالبة بالتعويض عن الأضرار الناجمة عن هذا الاعتداء يستوي في ذلك أن يكون الضرر ماديا أو معنويا.",
                keywords: "مسؤولية مدنية، معطيات ذات طابع شخصي، إجراءات وقتية، تعويض."
            },
            {
                name: "د. عبد العزيز لعبيدي",
                title: "أسباب اللجوء في القارة الافريقية واثاره",
                caracteres: [
                    "أستاذ زائر بجامعة سيدي محمد بن عبد الله - فاس",
                    "المملكة المغربية"
                ],
                summary:'يهدف هذا البحث من جهة أولى إلى بيان واقع اللاجئين بالقارة الافريقية والاوضاع المزرية التي يعانون منها باعتبارهم فئة هشة الأكثر عرضة للمخاطر، ومن جهة ثانية يرمي هذا البحث إلى الوقوف على الجهود الاقليمية الافريقية الرسمية والمؤسساتية من  أجل ضمان رعاية وحماية كافية اللاجئين، كما يسعى من جهة ثالثة الى بيان مدى نجاعة الجهود الوطنية الافريقية والدولية في الحد من تزايد اللاجئين جراء الكوارث التي تشهدها افريقيا من حروب ونزاعات مسلحة لا تكاد تخلو منها جل مناطق القارة الافريقية، بالإضافة إلى الظروف المناخية التي تعاني منها القارة الافريقية.',
                keywords:'اللاجئ، الحماية، منظمة الوحدة الافريقية، آليات حماية اللاجئ، أسباب اللجوء في إفريقيا.'
            },
            {
                name: 'عثمان أبو سعيد',
                title: 'علم اللغة وأهميته عند أبي حيان الأندلسي(تـ745ه) من خلال مقدمة تفسيره البحر المحيط',
                caracteres: [
                    'طالب في سلك الدكتوراه',
                    'الفكر الإسلامي المغربي: الخصائص المنهجية والتحديات المعرفية',
                    'مختبر الدراسات والأبحاث الإسلامية',
                    'كلية الآداب والعلوم الإنسانية المحمدية',
                    'جامعة الحسن الثاني الدار البيضاء',
                    'المملكة المغربية'
                ],
                summary:"إن أولية علم مفردات اللغة في تفسير القرآن الكريم مسألة أجمع عليها السلف والخلف، فاعتبروه لبنةً أساسية في بناء العملية التفسيرية وآلية أساسية للتدبر، لأن فهم الكل فرع عن الفهم الصحيح لأجزائه، وبعضُ الجهل بالجزء يُفضي إلى زيادة جَهلٍ بالمجموع. وهذا المقال يكشف النقاب عن وعي أبي حيان بأهمية علم اللغة من خلال خطاب مقدمة البحر المحيط، وذلك من خلال عدِّه أول العلوم التي يحتاجها المفسر للكلام المنزَّل، وللإحاطة بالموضوع انتظم المقال في مبحثين يتضمن كل منهما مطلبين، خصصت المبحث الأول للحديث عن مفهوم علم اللغة وأهميته في التفسير عامة وعند أبي حيان خاصة، وذلك بتتبع كلامه المنثور في ثنايا خطاب مقدمته، وجعلت المبحث الثاني للمصنفات اللغوية التي اعتبرها أبو حيان أفضل ما وضع في هذا العلم، وقد تنوعت هذه المصنفات بين معاجم عامة ومعاجم الأفعال، ولما كان من مقاصد التأليف تميم ناقص أتممت ما نقص من ذكر المصنفات التي اهتمت بحروف المعاني، وختمت هذا المبحث بالمحفوظات الشعرية التي خصها أبو حيان بالذكر. وختاما، فلو كان تفسير أبي حيان بحر محيط تلاطمت أمواجه، فعلم اللغة مجدافٌ من المجاديف التي يحتاجها راكبه.",
                keywords: 'علم اللغة، أبو حيان الأندلسي، تفسير البحر المحيط.'
            },
            {
                name: 'إبراهيم بنُ يوسف القائدي',
                title: 'سلطة الدلالة السياقية والحقلية للكلمة الشّعرية في الشِّعر العربي: مُقاربة معجمية في قصيدة "المواكب" لجبران خليل جبران',
                caracteres: [
                    'المملكة المغربية'
                ],
                summary:'لَقَد رأى الدّرس اللساني المُستَجِد، والمُواكِب لنموِّ المَعارف اللسانية في مُختلِف حقول وروافد الدّراسات اللغوية، ومُنذُ النِّصف الثاني مِن القرن العشرين الماضي، وحَسْبَ ما تَوقّفنا عنده فَقَد تغيّرت اهتمامات الدّرس والبحث اللّسانيّين في مُقاربتهما اللغة مُقاربات عديدة، كالمقاربة الدّلالية، وهو ما يعني أنه صارَ لِزامًا على الدّرس اللساني الجديد أنْ ينظُرَ إلى اللّغة نَظرة مُغايرةً لنظرته إليها في بدايات نُشوء، وظهور البحث اللساني مع "دي سوسير"، ومن جاء بَعْده مِن أتباع، حَملوا مِشعَل أبحاثه، وأقواله، ونظرياته في دراسة اللغة، وهو ما نتَج عنه مدارس عديدة، كالمَدرسة البنيوية، واللسانيات الوصفية، واللسانيات التاريخية، واللسانيات التوليدية، والتي كانتْ كُلّها تُعنى بِدراسة بِناء اللغة الدّاخلي، ودراسة اللغة ووظائفها في ذاتها ولأجل ذاتها، وإنّ ما دعا إليه البحث اللساني – وهو ما أسميناه بالدرس اللساني النقدي الجديد – في هذا السيّاق، أنّه يجب إعادة الاعتبار إلى اللغة في دراستها، فهي نتاج بشري خالص، وقَد جُعلتْ لِتخدم الإنسان في مُختلِف أطوار حياته، وفي مُختلِف العصور، أي أنّها مِن الإنسان وإلى الإنسان، وهذا الاعتبار لَن يكونَ إلّا بتقديم دراسات لسانيةٍ تُعنى بِدراسة قُدرة اللغة في مُختلِف عناصرها البنائية، لاسيما "الكلمات" على تفسير مُختلِف مناحي الحياة الإنسانية، وذلك بتوليد مناهج لسانية جديدة، تستطيع أنْ تَقَدّم نظرياتٍ، وتصورات علميةً، قادرة على توظيف اللغة وأدواتها لتفسير حياة الإنسان بمختلِف تفاصيلها، وذلك بالانطلاق مِن مُختلِف إسهاماته، التي تُظهر حياته، وتفاعلَها في إطار عملية التأثير والتّأثر مع تغيّرات حياته، ولا أفضل مِن الانطلاق مِن إسهامه في الأعمال الإبداعية، التي تظهر فيها ذاته في علاقتها بعوامل محيطه. ومَعلومٌ أنّ الدّرسَ اللساني يحوي فُروعًا عديدةً، كالدراسة المعجمية للغة، والدراسة الدّلالية للغة...، ويهمّنا هنا الدّراسة اللسانية المُعجمية الجديدة، التي دعتْ إلى مُقاربة اللغة مِن خلال أدواتها، التي هي "الكلمات"، مُقاربة اجتماعية، وفْق نظريات ومناهج لسانية دلالية جديدة، كنظرية السيّاق والحقول الدّلالية',
                keywords: 'الدّلالة السيّاقية، الدّلالة الحقولية، الكلمة الشّعرية، الدّلالة المُعجمية، قصيدة المواكب.'
            },
            {
                name: 'محمد فنان',
                title: 'إهمالات البلاغة الجديدة',
                caracteres: [
                    'المملكة المغربية'
                ],
                summary:' يدرس هذا المقال أبرز صور للتجديد التي جاءت بها البلاغة الجديدة مع شايم بيرلمان. ويركز على الجهود التي بذلها في سبيل إقامة بلاغة مغايرة ترتبط بالحياة المعاصرة، ولا تلغي الإرث الأرسطي. وقد جاء المقال عارضا هذه الصور التجديدية في صيغتها البيرلمانية. غير أن مشروع بيرلمان، وقد نظر إلى البلاغة بوصفها إمبراطورية، أهمل عددا من العناصر الجوهرية التي يتحقق بها الإقناع، ويبنى بها الحجاج. وهو ما جاء هذا المقال للتركيز عليه، وإظهار. ويأتي هذا العمل إلى جانب أعمال أخرى سابقة تم الانطلاق منها في بناء موضوع المقال، وتعميق تحليله. ونشير إلى أن ما أهملته بلاغة بيرلمان، هو ما جاء فيما بعد في مشاريع موالية، منها منجزات بلانتان، ومشيل مايير، روث، وغيرهم..',
                keywords: 'البلاغة الجديدة، شايم بيرلمان، التجديد، الحجاج، الإقناع، الإرث الأرسطي.'
            },
            {
                name: 'المصطفى عقاد',
                title: 'الصور والأيقونات في الكتاب المدرسي للغة الأمازيغية',
                caracteres: [
                    'أستاذ مكون بالمركز الجهوي لمهن التربية والتكوين بجهة طنجة تطوان الحسيمة - الفرع الإقليمي بالحسيمة',
                    'طالب باحث بسلك الدكتوراه بجامعة سيدي محمد بن عبد الله بكلية الآداب والعلوم الإنسانية سايس – فاس',
                    'مختبر اللغات والآداب والخيال والجمالية',
                    'المملكة المغربية'
                ],
                summary: 'يبرز هذا المقال، مكانة الكتاب المدرسي للغة الأمازيغية باعتباره الحامل الديداكتيكي الذي سيرافق المتعلم عبر ينابيع اشتغال تعلم اللغة في مستوياته الأربعة (استماع/تحدث، قراءة/كتابة). هذا الاشتغال لا يستحضر الألسني فحسب، بل يضمّ بين جَنَبَاتِه صورا وأيقونات يُفتـرض أنّها في آن معا تشوير وترقين ولغة مرافقة ثانية وبسنن مغايرة.\nوعلى الصورة أن تضمن لأي متعلم الولوج في ثناياها بدافع تحفيزي منها، وأن توفر بيسر بيئة سلسة لتواصل ثري، في سياقات موجهة تعرض في سيرورتها صورا تسبق النص؛ تشتغل إما كمادة أساسية لتواصل لاحق أو صورا تالية للنص، لأنها تترجم "transcodage" وتُرَقِّن "Illustre" بسننها الخاصة فحوى النصوص المكتوبة في تماثل وتكامل بين الرسالتين: الأيقونية واللسانية. وإذا كان الأمر كذلك فإنّ العبرة لا تقتصر على الاختيار الجيّد للنصوص اللّغوية بقدر ما ترتبط كذلك بانتقاء الصّور والأيقونات المعبّرة والملائمة لغاية النّصوص المقترحة، وأيضا برصها في تناسق مع هذه الأخيرة.\nوفي هذا الصدد، سنعمل في هذا البحث على الانطلاق من المنظور السيميولوجي للصورة، ثم نعرج على البيداغوجيا بالصورة واشتغال هذه الأخيرة في الفعل التربوي، للوقوف عند قياس مكانة الصورة والأيقونة ودورها في مكونات الكتاب المدرسي للغة الأمازيغية من خلال تحليل وثيقة ومعطيات استمارة.',
                keywords: 'الكتاب المدرسي، ترقين بالصور، الرسالة الأيقونية، البيداغوجيا بالصورة، مكونات اللغة الأمازيغية.'
            },
            {
                name: 'د. هشام البدري',
                title: 'المنهج الوصفي؛ مفهومه، وأساليبه، ومجالاته',
                caracteres: [
                    'باحث في العلوم الشرعية ومناهجها',
                    'المملكة المغربية'
                ],
                summary: 'يعتبر البحث في مجال المناهج العلمية  من الأهمية بمكان؛ حيث تعتبر من الأسس و القواعد التي لا بد للباحث أن يعتمد عليها في إعداد بحثه إعدادا علميًا دقيقًا.\n ومن بين هذه المناهج العلمية المعتبرة والتي لا يحسن بطالب العلم أن يجهلها؛ (المنهج الوصفي)، الذي اخترته عنوانا لمقالتي، والذي حاولت من خلاله أن أجلي بعضا من جوانب هذا المنهج العلمي المتميز، وذلك من خلال مبحثين اثنين؛\nالمبحث الأول: تحديد مفاهيم ومصطلحات المقالة؛\n-	مفهوم المنهج لغة\n-	مفهوم المنهج اصطلاحا\n-	مفهوم المنهج الوصفي\nالمبحث الثاني: أساليب المنهج الوصفي ومجالات توظيفه\nأساليب المنهج الوصفي\nمجالات توظيف المنهج الوصفي\nخاتمة: خلصت فيها إلى أن المنهج الوصفي هو من أهم المناهج العلمية التي تساعد الباحث على معرفة حقائق الموضوعات العلمية؛ سواء كانت مفاهيم ومصطلحات، أو أعلاما، أو كتبا، أو غير ذلك من المجالات؛ فلا تحليل، ولا مقارنة، ولا تأريخ، إلا بعد وصف وتشخيص ما نريد دراسته، ومعرفة عناصره، وخصائصه.',
                keywords: 'المناهج، المنهج الوصفي، الأساليب، المجالات'
            },
            {
                name: 'د. إبراهيم الهيباوي',
                title: 'الاقتصاد ودينامية الديموقراطية في المجتمع الحديث - نموذج أليكسيس دي طوكفيل',
                caracteres: [
                    'المملكة المغربية'
                ],
                summary:'يعتبر طوكفيل أبرز رواد التقليد السوسيولوجي الذي انطلق من تجليات الديموقراطية لتشخيص المجتمع الحديث وكشف فرادته عن الأنظمة السوسيوسياسية الاستبدادية والتقليدية، خاصة وأن الحقيقة الديموقراطية حسب فهمه تشكل موضوع علم الاجتماع العام وسوسيولوجيا السياسة حصرا، إنها ظاهرة تتطلب عُدة منهجية تستحضر متغيرات اجتماعية ومؤشرات اقتصادية وثقافة وسياسية مؤثرة فيها، تصنف مؤسسات المجتمع وفعل الأفراد بين ديموقراطية وتسلطية، ولأن الظاهرة الديموقراطية عنده ميزة تنفرد بها المجتمعات الحديثة، هذا الاعتقاد دفعه للتأكيد على دراسة الديموقراطية كظاهرة اجتماعية تتجلى في الحرية والمساواة، ولأنه سوسيولوجي اقترح تشخيصا علميا للديموقراطية يجمع بين البعد السوسيوسياسي (الحرية والمساواة)، وبين الحياة المادية للإنسان الديموقراطي، لذلك قدم مؤشرات التدافع الحاصل بين الوجه الديموقراطي للمجتمع والحياة المادية للناس، تدافع تختزله جدلية السياسة والاقتصاد في دفع أو كبح سير المجتمع نحو انتقالي ديموقراطي مكتمل، وعليه تحاول هذه الورقة تقديم قراءة سوسيولوجية لجدلية الاقتصاد والديموقراطية في الفكر الطوكفيلي عبر بحث غايات الدولة الديموقراطية وشعور الناس بالهناء والرفاه المادي، الذي يحققه التكامل بين الديموقراطية والتجارة، والديموقراطية والعمل، كتكامل يضمن تقدما مستقرا للمجتمع الديموقراطي.',
                keywords: 'المجتمع الحديث، الديموقراطية، المجتمع الديموقراطي، العمل، التجارة'
            },
            {
                name: 'العربي عكروش',
                title:'الهجرة القروية نحو المدينة: بين ترييف المجال وبداوة الإنسان مدينة امنتانوت نموذجا - دراسة تحليلية سوسيولوجية',
                caracteres: [
                    'باحث في علم الاجتماع',
                    'كلية الآداب والعلوم الإنسانية – مراكش',
                    'جامعة القاضي عياض',
                    'المملكة المغربية'
                ],
                summary:' بالمدينة، وتأثرها بجدلية الحياة الثقافية لمدينة امنتانوت بين الحداثة والبداوة، ومواصلة الضغط على الخدمات الأساسية.تهدف الدراسة إلى ملامسة موضوع أثر الهجرة القروية على ترييف المجال الحضري لامنتانوت، ورفع مستويات بداوة المقيمين بها. واتبع الباحث المنهج الاستكشافي التحليلي، وقد قام ببناء أدوات البحث بغية تجميع البيانات بطريقة مباشرة، من خلال استجواب عينة من الأسر القروية هاجرت مناطقها الأصلية واختارت الاستقرار بمدينة امنتانوت. وقد تكونت عينة هذه الدراسة من 347 أسرة قروية، قاطنة بمدينة امنتانوت، استخدم الباحث أداة رئيسية لجمع المعلومات والبيانات الخاصة بهذه الدراسة، وهي الاستمارة التي تم تعبئتها، وتم اعتمادها لمعالجة السؤال الإشكالي للدراسة: " إلى أي حد يمكن الحديث عن وجود علاقة جدلية بين ارتفاع وتيرة الهجرة القروية وبروز مظاهر ترييف المجال وترسيخ بداوة الإنسان بمدينة امنتانوت كقطب حضاري صاعد بإقليم شيشاوة؟"، والتحقق من الفرضيات المطروحة. وقد جاءت النتائج على النحو التالي : تعمل الهجرة القروية على ترسيخ بداوة التركيب البشري لمدينة امنتانوت، وتعميق مستويات فقدان التوازن بين استمرار التدفق القروي وتحدي التنمية الحضرية، وامتداد هيمنة الخصائص الريفية على التمدد العمراني بالهوامش الحضرية، وتعزيز ازدواجية الوجود الاجتماعي للمهاجرين القرويين بين البداوة والحضارة، كما تعمل الهجرة القروية على ترييف المجال الحضري لمدينة امنتانوت محكوم بهيمنة بداوة النشاط الاقتصادي، وبروز هيمنة النزعة القروية على الحركية اليومية للساكنة الحضرية، وتأرجح المهاجر القروي بين إغراء الحياة الحضرية وصعوبة الاندماج، واستمرار المواقف المحافظة في التعامل مع المرأة القروية رغم الاستقرار',
                keywords: 'الهجرة القروية، الحياة الجديدة، بداوة الإنسان، ترييف المدن'
            },
            {
                name: 'د. سعيد الأشعري',
                title: 'الزاوية الناصرية في ظل الدولة العلوية: تأثيرها وأدوارها المتعددة',
                caracteres: [
                    'أستاذ محاضر',
                    'كلية الآداب والعلوم الإنسانية - وجدة',
                    'المملكة المغربية'
                ],
                summary:'تُعدّ الزاوية الناصرية من أبرز الزوايا في تاريخ المغرب خلال القرنين السابع عشر والثامن عشر، وذلك بفضل الأدوار المتعددة التي اضطلعت بها في مختلف مجالات المجتمع المغربي خاصة في بداية العصر العلوي. من الناحية العلمية، أسهمت الزاوية في الحفاظ على التراث العلمي والفكري من خلال التعليم الذي تقدمه للطلبة، إضافة إلى توفير المخطوطات والمراجع التي أسهمت في إثراء الخزانة المغربية. كما كانت الزاوية الناصرية بمثابة مركز علمي رائد في فترة تميزت بتراجع ملحوظ في النشاط العلمي والفكري في البلاد. لا تزال الخزانة الناصرية بتامكروت تمثل وجهة رئيسية للطلبة والباحثين من مختلف أنحاء العالم حتى يومنا هذا. في السياق الديني، قامت الزاوية بنشر تعاليم الدين الصحيح والعمل على مكافحة البدع والشعوذة، مما جعلها مركزًا بارزًا للتربية الروحية والتوجيه الديني السليم. من الناحية الاقتصادية، أدت الزاوية دورًا حيويًا في تأمين الحماية للقوافل التجارية، مما ساهم في تنشيط الحركة التجارية والاقتصادية في المنطقة. على الصعيد الاجتماعي، قدمت الزاوية مساعدات كبيرة للفقراء والمحتاجين، كما ساهمت في حل النزاعات بين الأفراد والقبائل. أما من الناحية السياسية، فقد شهدت العلاقة بين شيوخ الزاوية والمخزن في البداية نوعًا من الحياد، ثم تطورت هذه العلاقة مع مرور الوقت إلى تقارب، ليصبح شيوخ الزاوية تابعين للمخزن بعد النزاع الداخلي على مشيخة الزاوية. وبذلك، تمكنت الزاوية الناصرية من الحفاظ على الاستقرار الاجتماعي في مرحلة حرجة من تاريخ المغرب بفضل هده الأدوار التي أدتها، دون أن تسعى إلى السلطة.',
                keywords: 'الزاوية الناصرية، العصر العلوي، الدور الديني، الدور الاجتماعي، الدور الاقتصادي، الاستقرار الاجتماعي.'
            },
            {
                name: 'Abdennabi MANDOUR et Adnane ELHAMESS',
                title: 'Coaching pédagogique : repenser la pratique de l’oral en classe de français au cycle secondaire qualifiant',
                caracteres: [
                    'Doctorant en quatrième année au sein du laboratoire LRALLARC',
                    'Doctorant en cinquième année au sein du laboratoire LIMPACT',
                    'FLSH- Marrakech-Maroc',
                    'FLSHBM-Béni Mellal-Maroc'
                ],
                summary: "Cet article analyse l'intégration du coaching pédagogique en classe de français, en particulier dans le cadre des activités orales. Il met en évidence l'importance de cette pratique innovante pour améliorer la participation des apprenants, leur motivation et leur expression orale. En abordant les obstacles classiques rencontrés par les enseignants et les apprenants, l'article propose des solutions concrètes tirées du coaching, telles que l’utilisation d'outils issus de la PNL et de la systémique, pour surmonter les difficultés liées à la confiance en soi, l'anxiété et les blocages émotionnels. L’article se base sur un état des lieux de l'enseignement du français au secondaire qualifiant et présente des pistes pour intégrer le coaching dans la pédagogie de l’enseignement du français afin de dynamiser l'apprentissage.",
                keywords: 'coaching, apprentissage, motivation, apprenants, obstacle.'
            }
        ]
    },
    {
        title: 'العدد الثاني',
        src: 'second',
        date:'2025-02-25T00:00:00',
        secondDate:"24 فبراير 2024",
        downUrl:"",
        issues:[]
    },
    {
        title: 'العدد الثالث',
        src: 'third',
        date:'2025-03-25T00:00:00',
        secondDate:"24 مارس 2024",
        downUrl:"",
        issues:[]
    }
];

// array contain just title and src 
const issuesName_Src=[]
issues.forEach(oneIssue => {
    issuesName_Src.push({
        title:oneIssue.title,
        src:oneIssue.src
    })
});

// function return the specific issue by research id
const getIssue= (src) =>{
    const issueFinded = issues.find(element => element.src == src)
    if(issueFinded){
        return issueFinded
    }
    return null
}

// function return the specific researc by issue's name and research id
const getResearch= (issue ,research) =>{
    const issueFounded = issues.find(element => element.src == issue)
    console.log(research)
    if (!issueFounded){
        return null
    }
    const researchFounded = issueFounded.issues[research-1]
    const researchLen = issueFounded.issues.length
    if(researchFounded){
        return {
            issues : researchFounded ,
            researchLen
        }
    }
    return null
}

export default issues
export {
    issuesName_Src,
    getIssue,
    getResearch
}
